//leap years คือ ปีที่มี 366 วัน 
//(ปี ค.ศ. ที่หารด้วย 4 ลงตัว ยกเว้นปีที่หาร 100 ลงตัว แต่หาร 400 ลงตัวจะเป็น leaf year)
//ขยายความ
//1. 100หารลงตัวไม่เป็น ยกเว้นหาร 400 ลงตัวจะเป็น
//2. ที่เหลื่อหาร 4 ลงตัวเป็น

// isLeapYear : year => boolen

const isLeapYear = year => {
    // #1.##################################################
    // if (year%4 === 0 && year%100 != 0){
    //     return true;
    // } else if (year % 100 ===0 && year%400 != 0){
    //     return false;
    // }else if (year%400 === 0){
    //     return true;
    // }
    // else{
    // return false;
    // }
    // ไม่ควรทำ เพราะเงือนไขซับซ้อน
    //ควรเอาตัวที่เกิดยากสุด หรือ เงือนไขซับซ้อนมากสุดมาดักก่อน
    // #2.##################################################
    // if (year%400 == 0 ){
    //         return true;
    // } else if (year % 100 ==0 ){
    //         return false;
    // }else if (year%4 === 0){
    //         return true;
    // }else{
    //     return false;
    // }

    // OR #3.###############################################
    // if (year%400 == 0 ){
    //     return true;
    // }
    // if (year % 100 ==0 ){
    //     return false;
    // }
    // if (year%4 === 0){
    //     return true;
    // }
    // return false;
    
    // OR #4.################################################
    // if (year % 100 === 0){
    //     return year % 400 ==0;
    // }
    // return year % 4 ==0;

    // OR #5.################################################
    return year % 100 === 0 ? year % 400 ==0 : year % 4 == 0;
    /*เช็คว่าหาร 100ลงตัวมั้ย 
    -ถ้า100ลงตัว(หน้า ? เป็นtrue จะทำตัวหน้า : ) 
    แล้วหาร400ลงมั้ย(ลงจะreturn true,ไม่ลงจะreturn false) แต่ถ้า100หารไม่ลงตัว(หน้า ? เป็นfalse จะทำตัวหลัง : ) จะเช็คว่าหาร4ลงตัวมั้ย(ลงจะreturn true,ไม่ลงจะreturn false)*/
}
console.log(isLeapYear(2000))